#### Terraform Plan 📋
```terraform
data.archive_file.scores_zip: Reading...
data.archive_file.users_zip: Reading...
data.archive_file.scores_zip: Read complete after 0s [id=5247bb0f9e36b7d500e629e99db5d61daa05fa0f]
data.archive_file.users_zip: Read complete after 0s [id=3e15dbf3f8929cbab275bbbb2152aaf6455becc7]
data.aws_iam_policy_document.lambda_assume_role: Reading...
data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.scores_lambda_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scores_lambda_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ScoresTableFullAccess"
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "UsersTableReadForScores"
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "SecretsManagerRead"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "CloudWatchLogs"
        }
    }

  # data.aws_iam_policy_document.users_lambda_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "users_lambda_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "UsersTableFullAccess"
        }
      + statement {
          + actions   = [
              + "cognito-idp:AdminAddUserToGroup",
              + "cognito-idp:AdminCreateUser",
              + "cognito-idp:AdminDeleteUser",
              + "cognito-idp:AdminGetUser",
              + "cognito-idp:AdminRemoveUserFromGroup",
              + "cognito-idp:ListUsers",
              + "cognito-idp:ListUsersInGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "CognitoAdminAccess"
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "SecretsManagerRead"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "CloudWatchLogs"
        }
    }

  # aws_api_gateway_authorizer.cognito will be created
  + resource "aws_api_gateway_authorizer" "cognito" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "cognito-authorizer"
      + provider_arns                    = (known after apply)
      + rest_api_id                      = (known after apply)
      + type                             = "COGNITO_USER_POOLS"
    }

  # aws_api_gateway_deployment.main will be created
  + resource "aws_api_gateway_deployment" "main" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "a75cea3b167348f536a6fc86cfc2d72434d36d99"
        }
    }

  # aws_api_gateway_resource.score_id will be created
  + resource "aws_api_gateway_resource" "score_id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{scoreId}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.scores will be created
  + resource "aws_api_gateway_resource" "scores" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "scores"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.user_id will be created
  + resource "aws_api_gateway_resource" "user_id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{userId}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.users will be created
  + resource "aws_api_gateway_resource" "users" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "users"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Score Tracker serverless REST API"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "score-tracker-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.main will be created
  + resource "aws_api_gateway_stage" "main" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "prod"
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
      + web_acl_arn          = (known after apply)
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                  + user           = "$context.identity.user"
                }
            )
        }
    }

  # aws_cloudwatch_log_group.apigw will be created
  + resource "aws_cloudwatch_log_group" "apigw" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/apigateway/score-tracker"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
    }

  # aws_cloudwatch_log_group.scores_lambda will be created
  + resource "aws_cloudwatch_log_group" "scores_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/score-tracker-scores"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
    }

  # aws_cloudwatch_log_group.users_lambda will be created
  + resource "aws_cloudwatch_log_group" "users_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/score-tracker-users"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
    }

  # aws_cognito_user.system_admin will be created
  + resource "aws_cognito_user" "system_admin" {
      + attributes            = {
          + "custom:role"    = "Admin"
          + "email"          = "venkattejamakkena+aws@gmail.com"
          + "email_verified" = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + message_action        = "SUPPRESS"
      + mfa_setting_list      = (known after apply)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "venkattejamakkena+aws@gmail.com"
    }

  # aws_cognito_user_group.admins will be created
  + resource "aws_cognito_user_group" "admins" {
      + description  = "Full access – manage users and scores"
      + id           = (known after apply)
      + name         = "Admins"
      + precedence   = 1
      + user_pool_id = (known after apply)
    }

  # aws_cognito_user_group.managers will be created
  + resource "aws_cognito_user_group" "managers" {
      + description  = "Can add scores; cannot manage users"
      + id           = (known after apply)
      + name         = "Managers"
      + precedence   = 2
      + user_pool_id = (known after apply)
    }

  # aws_cognito_user_group.viewers will be created
  + resource "aws_cognito_user_group" "viewers" {
      + description  = "Read-only access"
      + id           = (known after apply)
      + name         = "Viewers"
      + precedence   = 3
      + user_pool_id = (known after apply)
    }

  # aws_cognito_user_in_group.system_admin_group will be created
  + resource "aws_cognito_user_in_group" "system_admin_group" {
      + group_name   = "Admins"
      + id           = (known after apply)
      + user_pool_id = (known after apply)
      + username     = "venkattejamakkena+aws@gmail.com"
    }

  # aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OPTIONAL"
      + name                       = "score-tracker-user-pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true

          + invite_message_template {
              + email_message = "Your username is {username} and temporary password is {####}"
              + email_subject = "Your Score Tracker admin account"
              + sms_message   = "Your username is {username} and temporary password is {####}"
            }
        }

      + password_policy {
          + minimum_length                   = 12
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "5"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "role"
          + required                 = false

          + string_attribute_constraints {
              + max_length = "32"
              + min_length = "1"
            }
        }

      + software_token_mfa_configuration {
          + enabled = true
        }

      + user_pool_add_ons {
          + advanced_security_mode = "AUDIT"
        }
    }

  # aws_cognito_user_pool_client.web will be created
  + resource "aws_cognito_user_pool_client" "web" {
      + access_token_validity                         = 1
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = 1
      + logout_urls                                   = (known after apply)
      + name                                          = "score-tracker-web-client"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 30
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "hours"
          + id_token      = "hours"
          + refresh_token = "days"
        }
    }

  # aws_dynamodb_table.scores will be created
  + resource "aws_dynamodb_table" "scores" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "scoreId"
      + id               = (known after apply)
      + name             = "score-tracker-scores"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "scoreId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.users will be created
  + resource "aws_dynamodb_table" "users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "userId"
      + id               = (known after apply)
      + name             = "score-tracker-users"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "userId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_role.scores_lambda will be created
  + resource "aws_iam_role" "scores_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "score-tracker-scores-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.users_lambda will be created
  + resource "aws_iam_role" "users_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "score-tracker-users-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.scores_lambda will be created
  + resource "aws_iam_role_policy" "scores_lambda" {
      + id          = (known after apply)
      + name        = "score-tracker-scores-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.users_lambda will be created
  + resource "aws_iam_role_policy" "users_lambda" {
      + id          = (known after apply)
      + name        = "score-tracker-users-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_lambda_function.scores will be created
  + resource "aws_lambda_function" "scores" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./.build/scores.zip"
      + function_name                  = "score-tracker-scores"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "C+k4/umnbZGcrtG6WpN5gkuV2PCGO1Va2mMIezjIoBk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SCORES_TABLE" = "score-tracker-scores"
              + "USERS_TABLE"  = "score-tracker-users"
            }
        }
    }

  # aws_lambda_function.users will be created
  + resource "aws_lambda_function" "users" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./.build/users.zip"
      + function_name                  = "score-tracker-users"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ry4sPGfKRE8D0hH+royBMvPM6eoPx9aO+pF1T10i0Eo="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # aws_lambda_permission.scores_apigw will be created
  + resource "aws_lambda_permission" "scores_apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "score-tracker-scores"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.users_apigw will be created
  + resource "aws_lambda_permission" "users_apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "score-tracker-users"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_secretsmanager_secret.app_config will be created
  + resource "aws_secretsmanager_secret" "app_config" {
      + arn                            = (known after apply)
      + description                    = "Score Tracker runtime configuration"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "score-tracker/config"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "score-tracker"
        }
    }

  # aws_secretsmanager_secret_version.app_config will be created
  + resource "aws_secretsmanager_secret_version" "app_config" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.score_id_options.aws_api_gateway_integration.options will be created
  + resource "aws_api_gateway_integration" "options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.score_id_options.aws_api_gateway_integration_response.options_200 will be created
  + resource "aws_api_gateway_integration_response" "options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,POST,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.score_id_options.aws_api_gateway_method.options will be created
  + resource "aws_api_gateway_method" "options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.score_id_options.aws_api_gateway_method_response.options_200 will be created
  + resource "aws_api_gateway_method_response" "options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.scores_delete.aws_api_gateway_integration.this will be created
  + resource "aws_api_gateway_integration" "this" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.scores_delete.aws_api_gateway_method.this will be created
  + resource "aws_api_gateway_method" "this" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "DELETE"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.scores_get.aws_api_gateway_integration.this will be created
  + resource "aws_api_gateway_integration" "this" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.scores_get.aws_api_gateway_method.this will be created
  + resource "aws_api_gateway_method" "this" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.scores_options.aws_api_gateway_integration.options will be created
  + resource "aws_api_gateway_integration" "options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.scores_options.aws_api_gateway_integration_response.options_200 will be created
  + resource "aws_api_gateway_integration_response" "options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,POST,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.scores_options.aws_api_gateway_method.options will be created
  + resource "aws_api_gateway_method" "options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.scores_options.aws_api_gateway_method_response.options_200 will be created
  + resource "aws_api_gateway_method_response" "options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.scores_post.aws_api_gateway_integration.this will be created
  + resource "aws_api_gateway_integration" "this" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.scores_post.aws_api_gateway_method.this will be created
  + resource "aws_api_gateway_method" "this" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.user_id_options.aws_api_gateway_integration.options will be created
  + resource "aws_api_gateway_integration" "options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.user_id_options.aws_api_gateway_integration_response.options_200 will be created
  + resource "aws_api_gateway_integration_response" "options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,POST,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.user_id_options.aws_api_gateway_method.options will be created
  + resource "aws_api_gateway_method" "options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.user_id_options.aws_api_gateway_method_response.options_200 will be created
  + resource "aws_api_gateway_method_response" "options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.users_delete.aws_api_gateway_integration.this will be created
  + resource "aws_api_gateway_integration" "this" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.users_delete.aws_api_gateway_method.this will be created
  + resource "aws_api_gateway_method" "this" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "DELETE"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.users_get.aws_api_gateway_integration.this will be created
  + resource "aws_api_gateway_integration" "this" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.users_get.aws_api_gateway_method.this will be created
  + resource "aws_api_gateway_method" "this" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.users_options.aws_api_gateway_integration.options will be created
  + resource "aws_api_gateway_integration" "options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.users_options.aws_api_gateway_integration_response.options_200 will be created
  + resource "aws_api_gateway_integration_response" "options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,POST,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.users_options.aws_api_gateway_method.options will be created
  + resource "aws_api_gateway_method" "options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.users_options.aws_api_gateway_method_response.options_200 will be created
  + resource "aws_api_gateway_method_response" "options_200" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.users_post.aws_api_gateway_integration.this will be created
  + resource "aws_api_gateway_integration" "this" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.users_post.aws_api_gateway_method.this will be created
  + resource "aws_api_gateway_method" "this" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

Plan: 58 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_url             = (known after apply)
  + cognito_user_pool_client_id = (known after apply)
  + cognito_user_pool_id        = (known after apply)
  + dynamodb_scores_table       = "score-tracker-scores"
  + dynamodb_users_table        = "score-tracker-users"
  + scores_lambda_arn           = (known after apply)
  + users_lambda_arn            = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```